micropython/micropython/ports/esp8266/boards/GENERIC_512K/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "ESP module (512K)"
#define MICROPY_HW_MCU_NAME "ESP8266"

#define MICROPY_EMIT_XTENSA             (0)
#define MICROPY_EMIT_INLINE_XTENSA      (0)

#define MICROPY_DEBUG_PRINTERS          (0)

#define MICROPY_ERROR_REPORTING         (MICROPY_ERROR_REPORTING_TERSE)

#define MICROPY_VFS                     (0)
#define MICROPY_VFS_FAT                 (0)

#define MICROPY_PERSISTENT_CODE_LOAD    (0)

#define MICROPY_PY_IO_FILEIO            (0)

#define MICROPY_PY_SYS_STDIO_BUFFER     (0)
#define MICROPY_PY_BUILTINS_SLICE_ATTRS (0)
#define MICROPY_PY_ALL_SPECIAL_METHODS  (0)

#define MICROPY_PY_FRAMEBUF             (0)

#define MICROPY_PY_URE_SUB              (0)

#define MICROPY_PY_UCRYPTOLIB           (0)

// TODO
// #undef mp_import_stat
// #undef mp_builtin_open
// #undef mp_builtin_open_obj
